// cycles 
let num = 50

/*     // цикл while 
    while( num < 55) { // улсловие цикла 
        console.log(num); // код цикла
        num++; // дейстие с циклом
    } */
/*     // цикл do 
    do { // сначало делаем 
        console.log(num);
        num++;  
    }
    while (num < 55) // потом проверяем */

    for (let i = 1; i < 8; i++) { // задаем переменнуб, условие, действие 
        if( i == 6){ // условие
            //break;  прекращет действие цикла
            continue; // прерывает выполнения цикла при условии и продолжает его 
        }
        console.log(i)
    }


/* // переменные 
    var 
    let 
    const */
/* // улсовия 
    if(условие) {
        дейстивие
    } else {
        другое действие
    }

    switch (условие) {
        case проверка:
            действие(console.log);
        break; завершение условия;

        case проверка:
            действие(console.log);
        break; завершение условия;

        default: // значение если не выполняются условия 
            действие(алерт например);
            break; // обязательный аттрибут
    } */

/* // циклы 
    while(условие) {
        код, тело цикла
    }

    do { 
        сначало делаем 

    } while(условие);

    for(начало; условие; шаг) {
        телоцикла, действия
    } */