// конструкия свич поддерживает сразу несколько if 
/* let num = 45;

switch (num) {
    case num < 49:
        console.log("Это не верно");
        break; // для отделения одного условия от другого иначе будут выполняться все условия 
    case num > 100:
        console.log("много");
        break;
    case num > 80:
        console.log("Все еще много");
        break;
    case 50:
        console.log("Верно");
        break;
    default: 
        console.log("что то пошло не так");
        break;
} */

/* let a = 7;

switch (a) {
  case 3:
   console.log( 'Маловато' );
    break;
  case 4:
   console.log( 'В точку!' );
    break;
  case 5:
   console.log( 'Перебор' );
    break;
  default:
   console.log( "Нет таких значений" );
} */


/* let num = 110;

if (num < 49) {
    console.log("Это не верно");
} else if (num > 100 ) {
    console.log("много")
} else {
    console.log("это так")
} */

// унарный оператор участвует 1 аргумент(операнд)
/* let x = 1;

x = -x; // оператором является минус а в условии участвует только один аргумент  */
// Бинарный оператор участвуют 2 аргумента(операнд)
/* Преобразует строки в числа например 
let apples = "2"; Два это строка
let oranges = "3"; Три это строка

alert( apples + oranges ); вывод будет 23 */
/* let x = 1,
    y = 2;

x = y-x; // оператором является минус а в условии участвует два аргумента (операнда) */

// Тернарнный оператор участвуют 3 аргумента (операнд)
/* ( num == 50) ? console.log('Верно') : console.log('Неверно'); */
// улсловие ? результат если условие верное : результат если условие не верное;

/* if (2 * 4 == 7) {
    console.log("Верно");
} else {
    console.log("Неверно");
}
 */
